; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v10 ?v7)
             (pred_4 ?v5 ?v8)
             (pred_12 ?v10 ?v8)
             (pred_5 ?v6 ?v10 )
	     (pred_11 ?v10)
             (pred_10 ?v13)
             (pred_8 ?v5)
             (pred_7 ?v8)
             (pred_1 ?v10)
             (pred_6 ?v5)
             (pred_3 ?v10)
             (pred_2 ))



(:action op_5
:parameters (?v12 ?v1 ?v4 ?v9)
:precondition (and (pred_10 ?v12) (pred_10 ?v1) (pred_8 ?v4) (pred_7 ?v9)
          (pred_9 ?v12 ?v1) (pred_4 ?v4 ?v9)
                   (pred_12 ?v1 ?v9) (pred_11 ?v12) 
                   (pred_1 ?v1) (pred_6 ?v4))
:effect (and  (pred_3 ?v1) (not (pred_1 ?v1))))


(:action op_4
:parameters (?v12 ?v2)
:precondition (and (pred_10 ?v12) (pred_10 ?v2)
               (pred_11 ?v12) (pred_9 ?v12 ?v2) (pred_3 ?v2))
:effect (and (pred_11 ?v2) (not (pred_11 ?v12))))

(:action op_1
:parameters (?v12 ?v4)
:precondition (and (pred_10 ?v12) (pred_8 ?v4) 
                  (pred_11 ?v12) (pred_5 ?v4 ?v12) (pred_2 ))
:effect (and (pred_6 ?v4)
   (not (pred_5 ?v4 ?v12)) (not (pred_2 ))))


(:action op_3
:parameters (?v12 ?v11 ?v3)
:precondition (and (pred_10 ?v12) (pred_8 ?v11) (pred_8 ?v3)
                  (pred_11 ?v12) (pred_6 ?v3) (pred_5 ?v11 ?v12))
:effect (and (pred_6 ?v11) (pred_5 ?v3 ?v12)
        (not (pred_6 ?v3)) (not (pred_5 ?v11 ?v12))))

(:action op_2
:parameters (?v12 ?v4)
:precondition (and (pred_10 ?v12) (pred_8 ?v4) 
                  (pred_11 ?v12) (pred_6 ?v4))
:effect (and (pred_2 ) (pred_5 ?v4 ?v12) (not (pred_6 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_17 obj_07 obj_28 obj_19 obj_27 obj_10 obj_23 obj_14 obj_03 obj_26 obj_25 obj_05 obj_22 obj_09 obj_13 obj_29 obj_15 obj_02 obj_24 obj_11 obj_12 obj_21 obj_31 obj_20
    obj_08 obj_06 obj_16
    obj_18 obj_01 obj_30
    )

    (:init
       (pred_2)

       (pred_10 obj_04)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_28)
       (pred_10 obj_19)
       (pred_10 obj_27)
       (pred_10 obj_10)
       (pred_10 obj_23)
       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_26)
       (pred_10 obj_25)
       (pred_10 obj_05)
       (pred_10 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_29)
       (pred_10 obj_15)
       (pred_10 obj_02)
       (pred_10 obj_24)
       (pred_10 obj_11)
       (pred_10 obj_12)
       (pred_10 obj_21)
       (pred_10 obj_31)
       (pred_10 obj_20)
       (pred_7 obj_08)
       (pred_7 obj_06)
       (pred_7 obj_16)
       (pred_8 obj_18)
       (pred_8 obj_01)
       (pred_8 obj_30)

       (pred_9 obj_04 obj_27)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_07 obj_23)
       (pred_9 obj_07 obj_28)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_28 obj_14)
       (pred_9 obj_28 obj_19)
       (pred_9 obj_28 obj_07)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_28)
       (pred_9 obj_27 obj_26)
       (pred_9 obj_27 obj_10)
       (pred_9 obj_27 obj_04)
       (pred_9 obj_10 obj_25)
       (pred_9 obj_10 obj_23)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_10 obj_27)
       (pred_9 obj_23 obj_05)
       (pred_9 obj_23 obj_14)
       (pred_9 obj_23 obj_07)
       (pred_9 obj_23 obj_10)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_14 obj_03)
       (pred_9 obj_14 obj_28)
       (pred_9 obj_14 obj_23)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_03 obj_14)
       (pred_9 obj_26 obj_13)
       (pred_9 obj_26 obj_25)
       (pred_9 obj_26 obj_27)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_25 obj_05)
       (pred_9 obj_25 obj_10)
       (pred_9 obj_25 obj_26)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_05 obj_22)
       (pred_9 obj_05 obj_23)
       (pred_9 obj_05 obj_25)
       (pred_9 obj_22 obj_02)
       (pred_9 obj_22 obj_09)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_22 obj_05)
       (pred_9 obj_09 obj_24)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_22)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_29)
       (pred_9 obj_13 obj_26)
       (pred_9 obj_29 obj_12)
       (pred_9 obj_29 obj_15)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_29 obj_13)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_15 obj_29)
       (pred_9 obj_02 obj_31)
       (pred_9 obj_02 obj_24)
       (pred_9 obj_02 obj_22)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_24 obj_09)
       (pred_9 obj_24 obj_02)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_12 obj_21)
       (pred_9 obj_12 obj_29)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_21 obj_31)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_21 obj_12)
       (pred_9 obj_31 obj_20)
       (pred_9 obj_31 obj_02)
       (pred_9 obj_31 obj_21)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_31)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_20)
       (pred_12  obj_19 obj_08)
       (pred_12  obj_14 obj_06)
       (pred_12  obj_20 obj_16)
       (pred_3 obj_04)
       (pred_3 obj_17)
       (pred_3 obj_07)
       (pred_3 obj_28)
       (pred_3 obj_27)
       (pred_3 obj_10)
       (pred_3 obj_23)
       (pred_3 obj_03)
       (pred_3 obj_26)
       (pred_3 obj_25)
       (pred_3 obj_05)
       (pred_3 obj_22)
       (pred_3 obj_09)
       (pred_3 obj_13)
       (pred_3 obj_29)
       (pred_3 obj_15)
       (pred_3 obj_02)
       (pred_3 obj_24)
       (pred_3 obj_11)
       (pred_3 obj_12)
       (pred_3 obj_21)
       (pred_3 obj_31)

       (pred_4  obj_18 obj_08)
       (pred_4  obj_01 obj_06)
       (pred_4  obj_30 obj_16)
       (pred_5 obj_18 obj_25)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_30 obj_09)
       (pred_11 obj_02)
    )

    (:goal (and
       (pred_5 obj_18 obj_11)
       (pred_5 obj_01 obj_07)
    ))
(:constraints
  (always (not (pred_11 obj_15)))
)
)

; plan
1. (op_4 obj_02 obj_31)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_31)
   goals met: 0 of 2
2. (op_4 obj_31 obj_21)
   deleted: (pred_11 obj_31)
   added: (pred_11 obj_21)
   goals met: 0 of 2
3. (op_1 obj_21 obj_01)
   deleted: (pred_5 obj_01 obj_21) (pred_2)
   added: (pred_6 obj_01)
   goals met: 0 of 2
4. (op_4 obj_21 obj_12)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_12)
   goals met: 0 of 2
5. (op_4 obj_12 obj_29)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_29)
   goals met: 0 of 2
6. (op_4 obj_29 obj_25)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_25)
   goals met: 0 of 2
7. (op_3 obj_25 obj_18 obj_01)
   deleted: (pred_6 obj_01) (pred_5 obj_18 obj_25)
   added: (pred_6 obj_18) (pred_5 obj_01 obj_25)
   goals met: 0 of 2
8. (op_4 obj_25 obj_29)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_29)
   goals met: 0 of 2
9. (op_4 obj_29 obj_12)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_12)
   goals met: 0 of 2
10. (op_4 obj_12 obj_11)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_11)
   goals met: 0 of 2
11. (op_2 obj_11 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_2) (pred_5 obj_18 obj_11)
   goals met: 1 of 2
12. (op_4 obj_11 obj_12)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_12)
   goals met: 1 of 2
13. (op_4 obj_12 obj_29)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_29)
   goals met: 1 of 2
14. (op_4 obj_29 obj_25)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_25)
   goals met: 1 of 2
15. (op_1 obj_25 obj_01)
   deleted: (pred_5 obj_01 obj_25) (pred_2)
   added: (pred_6 obj_01)
   goals met: 1 of 2
16. (op_4 obj_25 obj_10)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_10)
   goals met: 1 of 2
17. (op_4 obj_10 obj_17)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_17)
   goals met: 1 of 2
18. (op_4 obj_17 obj_07)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_07)
   goals met: 1 of 2
19. (op_2 obj_07 obj_01)
   deleted: (pred_6 obj_01)
   added: (pred_2) (pred_5 obj_01 obj_07)
   goals met: 2 of 2
